Шаблоны/GetReqDocuments.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:smev="http://smev.gosuslugi.ru/#VERSION#"
                  xmlns:soc="http://socit.ru"
                  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
                  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
                  xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
  <soapenv:Body wsu:Id="body">
    <soc:GetRequiredDocuments>
      <smev:Message>
        <smev:Sender>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Sender>
        <smev:Recipient>
          <smev:Code>#SND_CODE#</smev:Code>
          <smev:Name>#SND_NAME#</smev:Name>
        </smev:Recipient>
        <smev:Service>
          <smev:Mnemonic>#SERVICE_MNEMONIC#</smev:Mnemonic>
          <smev:Version>#SERVICE_VERSION#</smev:Version>
        </smev:Service>
        <smev:TypeCode>GSRV</smev:TypeCode>
        <smev:Status>REQUEST</smev:Status>
        <smev:Date>#DATE#</smev:Date>
        <smev:ExchangeType>1</smev:ExchangeType>
        <smev:ServiceCode>#SERVICE_CODE#</smev:ServiceCode>
        <smev:CaseNumber>#CASE_NUM#</smev:CaseNumber>
	    <smev:TestMsg>Test</smev:TestMsg>
      </smev:Message>
      <smev:MessageData>
        <smev:AppData>
          <soc:userData>
            <soc:snils>#SNILS#</soc:snils>
          </soc:userData>
        </smev:AppData>
      </smev:MessageData>
    </soc:GetRequiredDocuments>
  </soapenv:Body>
</soapenv:Envelope>
